cfd/openfoam/incompressible/simpleFoam/04_tetMesh/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// ************************************************************************** //

transportModel  Newtonian;

nu [0 2 -1 0 0 0 0] 1.78e-05;

// ************************************************************************** //
